# Popularity Based Recommender Systems

In [1]:
import pandas as pd

In [2]:
ratings=pd.read_csv("ml-100k/u.data",sep="\t",header=None,names=['user_id','movie_id','rating'],usecols=range(3))
#comma seperated Values

In [3]:
ratings.head()

   user_id  movie_id  rating
0      196       242       3
1      186       302       3
2       22       377       1
3      244        51       2
4      166       346       1

In [4]:
movies=pd.read_csv("ml-100k/u.item",sep="|",header=None,encoding="iso-8859-1",names=['movie_id','title'],usecols=range(2))

In [5]:
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [6]:
ratings=pd.merge(movies,ratings)

In [7]:
ratings.head()

   movie_id             title  user_id  rating
0         1  Toy Story (1995)      308       4
1         1  Toy Story (1995)      287       5
2         1  Toy Story (1995)      148       4
3         1  Toy Story (1995)      280       4
4         1  Toy Story (1995)       66       3

In [8]:
ratings.title.nunique()

1664

In [9]:
import numpy as np